<template>
	<view class="privacy">
		<view class="privacy-title">
			校园招聘用户隐私政策
		</view>
		<view class="privacy-content">
			<view class="title">
				最近更新日期：2021年 12 月 6 日
			</view>
			<view class="paragraph line-one">
				校园招聘股份有限公司（以下简称“校园招聘”或“我们”）非常注重保护用户（以下或称“您”）的个人信息及隐私，我们深知个人信息对您的重要性，并将按照法律法规要求和业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。我们希望通过本《校园招聘用户隐私政策》（以下简称“本隐私政策”）向您清晰地介绍在您访问“校园招聘”小程序向您提供服务时，我们如何处理您的个人信息，以及我们为您提供的访问、更正、删除和保护这些信息和联系我们的方式。
			</view>
			<view class="paragraph">
				本隐私政策将帮助您了解以下内容：
			</view>
			<view>
				1、我们如何收集和使用您的个人信息；
			</view>
			<view>
				2、我们如何使用Cookie和同类技术；
			</view>
			<view>
				3、我们如何共享、转让、公开披露您的个人信息；
			</view>
			<view>
				4、我们如何保存和保护您的个人信息； 
			</view>
			<view>
				5、您如何管理您的个人信息； 
			</view>
			<view>
				6、未成年人的个人信息保护；
			</view>
			<view>
				7、通知和修订； 
			</view>
			<view>
				8、如何联系我们； 
			</view>
			<view>
				9、附录
			</view>
			<view class="line-one">
				【特别提示】请您在使用我们提供的各项服务前，仔细阅读并充分理解本隐私政策（重点内容我们以黑体加粗或加下划线的形式提示您重点注意）并作出相应选择。一旦您选择使用或继续使用我们的服务，即意味着您同意我们按照本隐私政策处理您的相关信息。如对本隐私政策有任何疑问，您可以通过本隐私政策“八、如何联系我们”中提供的方式与我们联系）。
				请您注意，不同应用的功能可能存在一定的差异，具体以您实际使用的功能为准。此外，针对某些特定的服务，我们还将制定单独的隐私政策，向您说明这些服务的特殊政策。如相关特定的隐私政策与本隐私政策有不一致之处，适用相关特定隐私政策。
				请您注意，本隐私政策不适用于您通过我们的服务而接入的其他第三方产品/服务(“其他第三方”包括您的交易相对方、任何第三方网站以及第三方服务提供者等)，具体规定请参照该第三方的隐私政策或类似声明。我们建议您在接受相关服务和提供个人信息前阅读并确认理解该等隐私政策。 
			</view>
			<view>
				一、我们如何收集和使用您的个人信息
				在您使用我们的服务时，我们可能在以下场景收集和使用您的个人信息，其中的个人敏感信息我们以下划线的形式标记：
			</view>
			<view>
				（一）基本功能
				为了向您提供我们服务的基本功能，我们需要收集、使用必要的个人信息，如您拒绝提供该等必要信息，您将无法正常使用我们的服务。我们会遵循正当、合法、必要的原则，出于本隐私政策所述的下列目的收集和使用您的个人信息。
			</view>
			<view>
				1、帮助您成为我们的用户
				为遵守法律法规的规定，以及向您提供更个性化、更便捷的服务，在您注册成为校园招聘用户时，您需要提供手机号码以创建校园招聘账号，并完善相关的网络身份识别信息（如头像、昵称及登录密码等）；若您以其他方式关联登录，我们会向关联第三方请求您的个人信息，对于我们要求但第三方无法提供的个人信息，我们仍可能会要求您提供：
			</view>
			<view>
				（1）当您使用微信账号登录时，我们会获取您的微信头像、昵称、性别和地区信息；
			</view>
			<view>
				（2）当您使用QQ账号登录时，我们会访问获取您的QQ头像、昵称、地区和性别信息；
			</view>
			<view>
				（3）当您使用支付宝账号登录时，我们会获取您的支付宝昵称、头像、性别和地区；
			</view>
			<view>
				（4）当您使用微博账号登录时，我们会获取您的微博昵称、头像；
			</view>
			<view>
				（5）当您使用Apple ID登录时，我们会获取您Apple ID的电子邮箱地址。为了确保账号安全和落实网络实名制，在您使用其他方式关联登录、使用某些功能时，您可能仍然需要绑定有效的手机号码。如果您仅需使用浏览、搜索等功能，您无需注册成为我们的用户以及提供上述信息。
			</view>
			<view>
				在提供账号信息的过程中，如果您愿意额外补充如下个人信息，将有助于我们向您提供更为个性化的服务：包括您的性别、生日。如果您选择不提供以上信息，也不会影响您享受我们服务的基本功能。
			</view>
			<view class="paragraph">
				2、向您提供基于地理位置的信息展示
				当您通过系统授权开启移动设备的定位功能并使用基于位置提供的服务时，我们会收集和使用您的位置信息以便为您匹配附近的校园招聘门店信息（例如您无需手动输入所在地理位置就可获得相关服务，估算校园招聘门店与您之间的实际距离方便您进行消费决策）。我们会使用有关技术获取您的位置信息（准确度会有所不同），这些技术包括IP地址、GPS以及能够提供相关信息的WLAN（如Wi-Fi）接入点、蓝牙和基站等。您可以在移动设备的系统中关闭定位服务停止我们对您所在位置信息的收集，但可能因此无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。
			</view>
			<view class="paragraph">
				3、为您提供预订、下单、订单管理功能
				为向您展示您账户的订单信息及便于您对订单信息进行管理，我们会收集您在使用我们服务过程中产生的订单信息。
				您在应用生成的订单中，将可能包含您的身份信息、联络信息、支付信息等，请您谨慎向他人展示或对外提供，我们也会在展示订单信息时，在保证信息可用性的基础上尽量去
			</view>
		</view>
	</view>
</template>

<script>
</script>

<style lang="scss" scoped>
	view{
		font-size: 26rpx;
	}
	.privacy{
		padding: 25rpx;
		.privacy-title{
			font-size: 36rpx;
			font-weight: bold;
			letter-spacing: 5rpx;
			text-align: center;
		}
		
		.privacy-content{
			margin-top: 50rpx;
			.title{
				text-align: center;
			}
			.paragraph{
				margin-top: 10rpx;
				font-size: 26rpx;
			}
			.line-one{
				margin-top: 20rpx;
			}
		}
	}
</style>
